In [19]:
import pyodbc
import pandas as pd

In [22]:
#conn = pymssql.connect(server=r'localhost', user='sa', password='123456', database='EmployeeDB')
conn = pyodbc.connect(r'Driver={SQL Server};Server=LAPTOP-LC4B480R\SQLEXPRESS;Database=EmployeeDB;Trusted_Connection=yes;')

In [28]:
query = "SELECT * FROM Employees"
df = pd.read_sql(query, conn)
print(df.head(10))

   ID FirstName  LastName  Gender  Salary
0   1      Mark  Hastings    Male   60000
1   2     Steve     Pound    Male   45000
2   3       Ben   Hoskins    Male   70000
3   4    Philip  Hastings    Male   45000
4   5      Mary   Lambeth  Female   30000
5   6   Valarie   Vikings  Female   35000
6   7      John  Stanmore    Male   80000

# mysql using ipython-sql in jupyter notebook inline

In [12]:
# !pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\gokul\anaconda3\lib\site-packages (0.3.9)
Requirement already satisfied: prettytable in c:\users\gokul\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: sqlparse in c:\users\gokul\anaconda3\lib\site-packages (from ipython-sql) (0.3.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\gokul\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in c:\users\gokul\anaconda3\lib\site-packages (from ipython-sql) (7.13.0)
Requirement already satisfied: six in c:\users\gokul\anaconda3\lib\site-packages (from ipython-sql) (1.14.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\gokul\anaconda3\lib\site-packages (from ipython-sql) (1.3.12)
Requirement already satisfied: setuptools>=18.5 in c:\users\gokul\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (46.0.0.post20200309)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\gokul\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: jedi>=0.10 in c:\users\gokul\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.14.1)
Requirement already satisfied: pickleshare in c:\users\gokul\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\users\gokul\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: backcall in c:\users\gokul\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: traitlets>=4.2 in c:\users\gokul\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\gokul\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.3)
Requirement already satisfied: pygments in c:\users\gokul\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: parso>=0.5.0 in c:\users\gokul\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.5.2)
Requirement already satisfied: wcwidth in c:\users\gokul\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.8)

In [57]:
import sqlalchemy
# 'PyMySQL://scott:tiger@localhost/foo'
sqlalchemy.create_engine('mysql+pymysql://gokul:123456@localhost/student')

Engine(mysql+pymysql://gokul:***@localhost/student)

In [2]:
# %%
%load_ext sql
# %reload_ext sql

In [58]:

# %%
%sql mysql+pymysql://gokul:123456@localhost/student

'Connected: gokul@student'

In [9]:
# !pip install PyMySQL

In [66]:
# %%
result_set=%sql  select  distinct name from students;

   mysql+pymysql://gokul:***@localhost/classicmodels
 * mysql+pymysql://gokul:***@localhost/student
4 rows affected.

In [26]:
type(result_set)

pandas.core.frame.DataFrame

In [67]:
result_set

       name
0  Abhishek
1      Aman
2    Anshul
3     Anand

In [42]:
# %config SqlMagic.autopandas=True
# %config SqlMagic.short_errors=False

In [41]:
# %config SqlMagic

SqlMagic options
--------------
SqlMagic.autocommit=<Bool>
    Current: True
    Set autocommit mode
SqlMagic.autolimit=<Int>
    Current: 0
    Automatically limit the size of the returned result sets
SqlMagic.autopandas=<Bool>
    Current: True
    Return Pandas DataFrames instead of regular result sets
SqlMagic.column_local_vars=<Bool>
    Current: False
    Return data into local variables from column names
SqlMagic.displaylimit=<Int>
    Current: None
    Automatically limit the number of rows displayed (full result set is still
    stored)
SqlMagic.dsn_filename=<Unicode>
    Current: 'odbc.ini'
    Path to DSN file. When the first argument is of the form [section], a
    sqlalchemy connection string is formed from the matching section in the DSN
    file.
SqlMagic.feedback=<Bool>
    Current: True
    Print number of rows affected by DML
SqlMagic.short_errors=<Bool>
    Current: True
    Don't display the full traceback on SQL Programming Error
SqlMagic.style=<Unicode>
    Current: 'DEFAULT'
    Set the table printing style to any of prettytable's defined styles
    (currently DEFAULT, MSWORD_FRIENDLY, PLAIN_COLUMNS, RANDOM)

In [68]:
# %%
%sql select * from faculties;

   mysql+pymysql://gokul:***@localhost/classicmodels
 * mysql+pymysql://gokul:***@localhost/student
4 rows affected.

   FacultyId     Name    Class          EmailId
0          1     Shah     Math     shah@xyz.com
1          2    Kumar    Hindi    kumar@xyz.com
2          3   Dahiya  English   dahiya@xyz.com
3          4  Gairols  Science  gairols@xyz.com

In [29]:
%sql alter table student add Address varchar(100);

 * mysql+pymysql://gokul:***@localhost/student
0 rows affected.

Empty DataFrame
Columns: []
Index: []

In [30]:
%sql select * from student;

 * mysql+pymysql://gokul:***@localhost/student
3 rows affected.

    ID    Name   Age Address
0  101   Mohit  20.0    None
1  102    Amit  15.0    None
2  103  Nikhil   NaN    None

In [31]:
%sql desc student;

 * mysql+pymysql://gokul:***@localhost/student
4 rows affected.

     Field          Type Null Key Default Extra
0       ID           int  YES        None
1     Name  varchar(100)  YES        None
2      Age           int  YES        None
3  Address  varchar(100)  YES        None

In [33]:
%sql alter table student add( Email_ID varchar(100),ContactNo varchar(100)) ;
%sql select * from student;

 * mysql+pymysql://gokul:***@localhost/student
0 rows affected.
 * mysql+pymysql://gokul:***@localhost/student
3 rows affected.

    ID    Name   Age Address Email_ID ContactNo
0  101   Mohit  20.0    None     None      None
1  102    Amit  15.0    None     None      None
2  103  Nikhil   NaN    None     None      None

In [34]:
%sql alter table student add( test int default 100) ;
%sql desc student;

 * mysql+pymysql://gokul:***@localhost/student
0 rows affected.
 * mysql+pymysql://gokul:***@localhost/student
3 rows affected.
 * mysql+pymysql://gokul:***@localhost/student
7 rows affected.

       Field          Type Null Key Default Extra
0         ID           int  YES        None
1       Name  varchar(100)  YES        None
2        Age           int  YES        None
3    Address  varchar(100)  YES        None
4   Email_ID  varchar(100)  YES        None
5  ContactNo  varchar(100)  YES        None
6       test           int  YES         100

In [35]:
%sql select * from student;

 * mysql+pymysql://gokul:***@localhost/student
3 rows affected.

    ID    Name   Age Address Email_ID ContactNo  test
0  101   Mohit  20.0    None     None      None   100
1  102    Amit  15.0    None     None      None   100
2  103  Nikhil   NaN    None     None      None   100

In [37]:
%sql alter table student modify ContactNo int  ;
%sql desc student;

 * mysql+pymysql://gokul:***@localhost/student
3 rows affected.
 * mysql+pymysql://gokul:***@localhost/student
7 rows affected.

       Field          Type Null Key Default Extra
0         ID           int  YES        None
1       Name  varchar(100)  YES        None
2        Age           int  YES        None
3    Address  varchar(100)  YES        None
4   Email_ID  varchar(100)  YES        None
5  ContactNo           int  YES        None
6       test           int  YES         100

In [38]:
%sql alter table student change Address Location varchar(100)  ;
%sql desc student;

 * mysql+pymysql://gokul:***@localhost/student
0 rows affected.
 * mysql+pymysql://gokul:***@localhost/student
7 rows affected.

       Field          Type Null Key Default Extra
0         ID           int  YES        None
1       Name  varchar(100)  YES        None
2        Age           int  YES        None
3   Location  varchar(100)  YES        None
4   Email_ID  varchar(100)  YES        None
5  ContactNo           int  YES        None
6       test           int  YES         100

In [39]:
%sql alter table student drop column test ;
%sql desc student;

 * mysql+pymysql://gokul:***@localhost/student
0 rows affected.
 * mysql+pymysql://gokul:***@localhost/student
6 rows affected.

       Field          Type Null Key Default Extra
0         ID           int  YES        None
1       Name  varchar(100)  YES        None
2        Age           int  YES        None
3   Location  varchar(100)  YES        None
4   Email_ID  varchar(100)  YES        None
5  ContactNo           int  YES        None

In [40]:
%sql alter table student drop column Email_ID ,drop column ContactNo;
%sql desc student;

 * mysql+pymysql://gokul:***@localhost/student
0 rows affected.
 * mysql+pymysql://gokul:***@localhost/student
4 rows affected.

      Field          Type Null Key Default Extra
0        ID           int  YES        None
1      Name  varchar(100)  YES        None
2       Age           int  YES        None
3  Location  varchar(100)  YES        None

In [43]:
%sql alter table student add( DOB int default 1995) ;
%sql desc student;

 * mysql+pymysql://gokul:***@localhost/student
0 rows affected.
 * mysql+pymysql://gokul:***@localhost/student
5 rows affected.

      Field          Type Null Key Default Extra
0        ID           int  YES        None
1      Name  varchar(100)  YES        None
2       Age           int  YES        None
3  Location  varchar(100)  YES        None
4       DOB           int  YES        1995

In [44]:
%sql select * from student

 * mysql+pymysql://gokul:***@localhost/student
3 rows affected.

    ID    Name   Age Location   DOB
0  101   Mohit  20.0     None  1995
1  102    Amit  15.0     None  1995
2  103  Nikhil   NaN     None  1995

In [48]:
%sql alter table student change  Name FullName varchar(100);
%sql desc student;

 * mysql+pymysql://gokul:***@localhost/student
0 rows affected.
 * mysql+pymysql://gokul:***@localhost/student
5 rows affected.

      Field          Type Null Key Default Extra
0        ID           int  YES        None
1  FullName  varchar(100)  YES        None
2       Age           int  YES        None
3  Location  varchar(100)  YES        None
4       DOB           int  YES        1995

In [50]:
%sql select fullname from student;

 * mysql+pymysql://gokul:***@localhost/student
3 rows affected.

  fullname
0    Mohit
1     Amit
2   Nikhil

***

In [ ]:
# classicmodels database

In [51]:
import sqlalchemy
# 'PyMySQL://scott:tiger@localhost/foo'
sqlalchemy.create_engine('mysql+pymysql://gokul:123456@localhost/classicmodels')

Engine(mysql+pymysql://gokul:***@localhost/classicmodels)

In [52]:
# %%
%load_ext sql
# %reload_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [53]:

# %%
%sql mysql+pymysql://gokul:123456@localhost/classicmodels

'Connected: gokul@classicmodels'

In [56]:
%sql select * from payments limit 5

 * mysql+pymysql://gokul:***@localhost/classicmodels
   mysql+pymysql://gokul:***@localhost/student
5 rows affected.

   customerNumber checkNumber paymentDate    amount
0             103    HQ336336  2004-10-19   6066.78
1             103    JM555205  2003-06-05  14571.44
2             103    OM314933  2004-12-18   1676.14
3             112    BO864823  2004-12-17  14191.12
4             112     HQ55022  2003-06-06  32641.98